---
kind: method
id: M:Autodesk.Revit.DB.Lighting.LightFamily.GetNumberOfLightTypes
source: html/f54b94fc-dd24-435d-02a1-6c836e1fc0c6.htm
---
# Autodesk.Revit.DB.Lighting.LightFamily.GetNumberOfLightTypes Method

Return the number of light types contained in this light family

## Syntax (C#)
```csharp
public int GetNumberOfLightTypes()
```

## Returns
The number of light types contained in this light family